app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."featured" = $1 LIMIT $2  [["featured", true], ["LIMIT", 3]]
SELECT "categories".* FROM "categories"
SELECT "posts".* FROM "posts" ORDER BY "posts"."views_count" DESC LIMIT $1  [["LIMIT", 4]]
---
  def index
    @featured_posts = Post.featured.limit(3)
    @categories = Category.all
    @popular_posts = Post.order(views_count: :desc).limit(4)