app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
UPDATE "posts" SET "views_count" = COALESCE("views_count", 0) + $1 WHERE "posts"."id" = $2  [["views_count", 1], ["id", 980190962]]
---
  def show
    @post = Post.find(params[:id])
    @post.increment!(:views_count) # Increment view count for each show

INSERT INTO "posts" ("title", "content", "youtube_url", "saved", "category_id", "created_at", "updated_at", "featured", "views_count") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @post = Post.new(post_params)
    if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
---
  def edit
    @post = Post.find(params[:id])

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
UPDATE "posts" SET "title" = $1, "content" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["title", "Updated Title"], ["content", "Updated body"], ["updated_at", "2024-09-03 16:09:00.359218"], ["id", 980190962]]
---
  def update
    @post = Post.find(params[:id])
    if @post.update(post_params)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 980190962]]
---
  def destroy
    @post = Post.find(params[:id])
    @post.destroy